app/controllers/payform_admin_controller.rb

  def show_all
    @department = get_dept_from_url
    if !params[:id] or params[:id].to_i != @department.id
      redirect_to :action => :show_all, :id => @department.id and return
    end
    @users = @department.users.search(params[:search]).sort_by(&:name)
---
SELECT * FROM "users" WHERE (login = 'njg24') LIMIT 1