app/controllers/payform_controller.rb

INSERT INTO "payforms" ("approved_by", "created_at", "week", "printed", "updated_at", "approved", "user_id", "year", "submitted", "department_id") VALUES(NULL, '2009-06-02 17:54:54', 23, NULL, '2009-06-02 17:54:54', NULL, 12, 2009, NULL, 5)
SELECT * FROM "payforms" WHERE (user_id = 12 and week = 23 and year = 2009 and department_id = 5) LIMIT 1
---
  def index
    if params[:payform] #only need to look if params[:id] set
      date = Date.parse(params[:payform][:week])
      week = date.cweek
      year = date.year
    end
    department = get_dept_from_url

    week = default_week_unless_already week
    year = default_year_unless_already year

    #find current payform and redirect to view
    current_payform = Payform.find_or_create(week, year, @user, department)

SELECT * FROM "payforms" WHERE ("payforms"."id" IS NULL) LIMIT 1
SELECT * FROM "payforms" INNER JOIN "payform_items_payforms" ON "payforms".id = "payform_items_payforms".payform_id WHERE ("payform_items_payforms".payform_item_id = 32 )
SELECT * FROM "users" WHERE (login = 'njg24') LIMIT 1
INSERT INTO "clocks" ("mass_clock_id", "created_at", "out", "updated_at", "in", "start", "user_id", "department_id") VALUES(NULL, '2009-06-02 17:54:55', NULL, '2009-06-02 17:54:55', NULL, NULL, 12, 5)
SELECT * FROM "clocks" WHERE ("clocks"."user_id" = 12) LIMIT 1
---
  def view
    @payform = Payform.find_by_id params[:id]
    @unpayformed_reports = ShiftReport.payform_not_auto.select { |r| r.shift.user==@user }
    if @payform and @payform.authorized?(@user, controller_name)
      @department = @payform.department
      session["current_chooser_choice"][controller_name] = @department.id
      @dates = get_previous_weeks
      @date = @payform.get_date
      @clock = Clock.find_or_create(@user, @department)

SELECT * FROM "payforms" WHERE (department_id = 5) AND ("payforms".user_id = 12)
---
  def view_all
    @department = get_dept_from_url
    if !params[:id] or params[:id].to_i != @department.id
      redirect_to :action => :view_all, :id => @department.id and return
    end
    @payforms = @user.payforms.all(:conditions => ["department_id = ?", @department.id])

SELECT * FROM "payforms" WHERE ("payforms"."id" = '54') LIMIT 1
UPDATE "payforms" SET "submitted" = '2009-06-03 17:55:47', "updated_at" = '2009-06-03 17:55:47' WHERE "id" = 54
---
  def submit
    payform = Payform.find_by_id params[:id]
    if payform and payform.authorized?(@user, controller_name)
      if payform.has_active_shifts?
        flash = "Payform has active shifts.  Please submit your shift report and
                then resubmit your payform."
      elsif payform.submitted
        flash = "Payform Already Submitted"
      else
        payform.submitted = Time.now
        flash = payform.save ? "Payform Submitted" : "Error Submitting Payform"