app/controllers/user_admin_controller.rb

  def manage_permissions
    @permissions = Permission.find(:all, :order => "name")
---
SELECT * FROM "permissions" WHERE ("permissions"."id" = 88)

  def edit_user
    if params[:id]
      @user = User.find(params[:id])
    else
      if not superuser_access? and params[:user] and params[:user][:login] and (existing_user = User.find_by_login(params[:user][:login]))
        @user = existing_user
        @user.active = true
      else
        @user = User.new
      end

      @user.departments << get_department if not superuser_access?
    end

    @departments = Department.find(:all, :order => 'name')
    @groups = filter_by_department(Group.find(:all, :order => "name"))
    @roles = filter_by_department(Role.find(:all, :order => "name"))


    if request.post? and params[:user]
      params[:user][:group_ids] ||= []
      params[:user][:role_ids] ||= []
      params[:user][:department_ids] ||= [] if superuser_access?

      params[:user][:role_ids] += filter_by_department(@user.roles, :invert => true).map {|role| "#{role.id}"}
      params[:user][:group_ids] += filter_by_department(@user.groups, :invert => true).map {|group| "#{group.id}"}
---
SELECT * FROM "users" WHERE ("users"."id" = 87)
SELECT * FROM "users" WHERE ("users"."login" = 'mpl36') LIMIT 1
SELECT * FROM "departments" WHERE ("departments"."id" = 1)
SELECT * FROM "groups" WHERE ("groups"."id" = 2)
SELECT * FROM "roles" WHERE ("roles"."name" = 'everyone') LIMIT 1
SELECT "departments".id FROM "departments" INNER JOIN "departments_groups" ON "departments".id = "departments_groups".department_id WHERE ("departments"."id" = 1) AND ("departments_groups".group_id = 8 ) LIMIT 1
SELECT "roles".id FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles"."id" = 3) AND ("roles_users".user_id = 87 ) LIMIT 1
SELECT "groups".id FROM "groups" INNER JOIN "groups_users" ON "groups".id = "groups_users".group_id WHERE ("groups"."id" = 4) AND ("groups_users".user_id = 87 ) LIMIT 1

  def edit_user_update_checkboxes
    @user = User.new
    @user.attributes = params[:user]

    @groups = filter_by_department Group.all
    @roles = filter_by_department Role.all
---
SELECT * FROM "groups" ORDER BY name
SELECT * FROM "roles" ORDER BY name

  def import_users
    @department ||= get_department
    if @department.name == 'All'
      redirect_with_flash('Admin must be in a department', :action => :index) and return
    end
    @failure = []
    @success = []
    wipe_group = params[:wipe]
    if request.post?
      user_str_list = params[:import].split ';'
      user_str_list.each do |user_str|
        name, netid, ein, *group_names = user_str.split ','
        unless name.blank? or netid.blank?
          user = User.find_or_create_by_login netid.squish
          user.name = name.squish
          user.ein = ein.squish.to_i unless (ein.nil? or ein.empty?)
          groups = group_names.map { |n| Group.find_by_name(n.squish) }
          groups.delete_if{|n| n.blank?}
          if wipe_group
            user.groups = groups
          else
            user.groups |= groups
          end

          user.departments << @department unless user.departments.include? @department
---
SELECT * FROM "users" WHERE ("users"."login" = 'njg24') LIMIT 1
SELECT * FROM "departments" ORDER BY name

  def export_users
    @department ||= get_department
    if @department.id.zero?
      redirect_with_flash('Admin must be in a department', :action => :index) and return
    end
    # users = @department.users.all #use .all because it would sort by name (see user.rb)
    @result = []
    if request.post?
      selected_users = User.get_selected(params)
      @result = selected_users.map{|u| [u.name, u.login, u.ein, u.groups.collect(&:name)].join(', ') }.join(";\n")
---
SELECT * FROM "users" WHERE ("users"."login" = 'njg24') LIMIT 1

  def find_and_create_roles_and_permissions(name, department)
    controller_role = Role.find_by_name(name)
---
SELECT * FROM "roles" WHERE ("roles"."name" = 'everyone') LIMIT 1